{
  "projects": [
      {
          "id": 0,
          "title": "Booki",
          "descriptions": {
              "fr": "Créez la page d'accueil d'une agence de voyage avec HTML & CSS",
              "en": "Create the homepage of a travel agency with HTML & CSS"
          },
          "mission": {
            "fr": "La mission de ce projet est de créer la page d'accueil d'une agence de voyage en utilisant HTML et CSS, en intégrant une interface responsive. Les maquettes Figma pour mobile, tablette et desktop ainsi que les images ont été fournies pour guider le développement. L'objectif était de créer des composants d'interface correspondant à la maquette, ce qui m'a permis de développer des compétences en design responsive et d'assurer que la page fonctionne bien sur tous les appareils. Ces compétences sont cruciales pour devenir un développeur front-end compétent dans le développement web moderne.",
            "en": "The mission of this project is to create the homepage of a travel agency using HTML and CSS, while integrating a responsive interface. Figma mockups for mobile, tablet, and desktop, as well as images, have been provided to guide development. The goal was to create interface components that match the mockup, allowing me to develop skills in responsive design and ensure that the page works well on all devices. These skills are crucial for becoming a competent front-end developer in modern web development."
          },
          "image": "./assets/images/booki.webp",
          "imageModal": ["./assets/images/logosDev/logoHTML.png", "./assets/images/logosDev/logoCSS.png", "./assets/images/logosDev/logoFigma.png", "./assets/images/logosDev/logoResponsive.png", "./assets/images/logosDev/logoGitHub.png "],
          "imageModalAlt": "Logos Languages",
          "link": "https://booki-yyyg.vercel.app/",
          "linkGithub": "https://github.com/IlonaTG/Booki.git",
          "categories": ["html-css"]
      },
      {
          "id": 1,
          "title": "OhMyFood",
          "descriptions": {
              "fr": "Améliorez l'interface d'un site mobile avec des animations CSS",
              "en": "Improve the interface of a mobile site with CSS animations"
          },
          "mission": {
            "fr": "La mission de ce projet consiste à intégrer une maquette mobile-first pour le site d'une start-up en utilisant Sass pour organiser et optimiser le CSS. Il falait implémenter des animations CSS pour enrichir l'expérience utilisateur et versionner le projet avec Git et GitHub. Ce projet m'a permis de comprendre l'importance de concevoir des sites web adaptatifs et réactifs, tout en me familiarisant avec des outils essentiels pour la gestion et la collaboration sur des projets de développement web.",
            "en": "The mission of this project was to integrate a mobile-first mockup for a start-up's website using Sass to organize and optimize the CSS. I implemented CSS animations to enhance the user experience and versioned the project with Git and GitHub. This project allowed me to understand the importance of designing adaptive and responsive websites, while familiarizing myself with essential tools for managing and collaborating on web development projects."
          },
          "image": "./assets/images/ohmyfood.webp",
          "imageModal": ["./assets/images/logosDev/logoHTML.png", "./assets/images/logosDev/logoCSS.png", "./assets/images/logosDev/logoSASS.png", "./assets/images/logosDev/logoFigma.png", "./assets/images/logosDev/logoResponsive.png", "./assets/images/logosDev/logoGitHub.png " ],
          "imageModalAlt": "Logos Languages",
          "link": "https://ilonatg.github.io/Projet-4/",
          "linkGithub": "https://github.com/IlonaTG/Projet-4.git",
          "categories": ["html-css"]
      },
      {
          "id": 2,
          "title": "Sophie Bluel",
          "descriptions": {
              "fr": "Créez une page web dynamique avec JavaScript",
              "en": "Create a dynamic webpage with JavaScript"
          },
          "mission": {
            "fr": "La mission de ce projet consistait à créer une page web dynamique pour le site d'une architecte d'intérieur en utilisant JavaScript et en communiquant avec une API. J'ai développé la partie front-end, y compris une page de présentation des travaux, une page de connexion pour l'administrateur, et une modale pour uploader de nouveaux médias. Ce projet m'a permis de gérer les événements utilisateurs, manipuler le DOM, et tester les fonctionnalités en communiquant avec un back-end.",
            "en": "The mission of this project was to create a dynamic web page for an interior designer's website using JavaScript and communicating with an API. I developed the front-end, including a portfolio page, an admin login page, and a modal for uploading new media. This project allowed me to manage user events, manipulate the DOM, and test functionalities by communicating with a back-end."
          },
          "image": "./assets/images/sophie-bluel.webp",
          "imageModal": ["./assets/images/logosDev/logoHTML.png", "./assets/images/logosDev/logoCSS.png", "./assets/images/logosDev/logoJS.png ", "./assets/images/logosDev/logoNode.png", "./assets/images/logosDev/logoAPI.png", "./assets/images/logosDev/logoFigma.png", "./assets/images/logosDev/logoResponsive.png", "./assets/images/logosDev/logoGitHub.png " ],
          "imageModalAlt": "Logos Languages",
          "link": "lien_vers_le_projet_SophieBluel",
          "linkGithub": "https://github.com/IlonaTG/P6.git",
          "categories": ["html-css", "js"]
      },
      {
          "id": 3,
          "title": "Kasa",
          "descriptions": {
              "fr": "Créez une application web de location immobilière avec React",
              "en": "Create a real estate rental web application with React"
          },
          "mission": {
            "fr": "La mission de ce projet consistait à implémenter le front-end d’une application en utilisant React et React Router pour créer une expérience utilisateur moderne et réactive. J'ai développé la logique de présentation des données et les composants React, configuré la navigation entre les différentes pages avec React Router, et utilisé des données simulées extraites d'un fichier JSON. Ce projet m'a permis de maîtriser des outils essentiels pour le développement d'applications web dynamiques et réactives.",
            "en": "The mission of this project was to implement the front-end of an application using React and React Router to create a modern and responsive user experience. I developed the data presentation logic and React components, configured navigation between different pages with React Router, and used simulated data extracted from a JSON file. This project allowed me to master essential tools for developing dynamic and responsive web applications."
          },
          "image": "./assets/images/kasa.webp",
          "imageModal": ["./assets/images/logosDev/logoHTML.png", "./assets/images/logosDev/logoCSS.png", "./assets/images/logosDev/logoJS.png ", "./assets/images/logosDev/logoReact.png ", "./assets/images/logosDev/logoSASS.png", "./assets/images/logosDev/logoFigma.png", "./assets/images/logosDev/logoResponsive.png", "./assets/images/logosDev/logoGitHub.png " ],
          "imageModalAlt": "Logos Languages",
          "link": "https://projet-8-kasa-lac.vercel.app/",
          "linkGithub": "https://github.com/IlonaTG/Projet-8-Kasa.git",
          "categories": ["html-css", "react"]
      },
      {
          "id": 4,
          "title": "Nina Carducci",
          "descriptions": {
              "fr": "Optimisez le référencement d'un site de photographe",
              "en": "Optimize the SEO of a photographer's website"
          },
          "mission": {
            "fr": "La mission de ce projet était d'optimiser le référencement d'un site web en améliorant sa performance et son accessibilité. Cela impliquait d'identifier les problèmes de chargement et de référencement, de proposer des recommandations pour les améliorer, d'appliquer ces améliorations en modifiant le code du site, et enfin de créer un rapport détaillant les résultats avant et après les modifications. Ces compétences sont essentielles pour améliorer la visibilité, l'accessibilité et l'expérience utilisateur d'un site web, ce qui est crucial dans le développement web.",
            "en": "The mission of this project was to optimize the SEO of a website by improving its performance and accessibility. This involved identifying loading and SEO issues, providing recommendations for improvement, implementing these enhancements by modifying the site's code, and finally creating a report detailing the results before and after the modifications. These skills are crucial for enhancing the visibility, accessibility, and user experience of a website, which is essential in web development."
          },
          "image": "./assets/images/nina-carducci.webp",
          "imageModal": ["./assets/images/logosDev/logoHTML.png", "./assets/images/logosDev/logoCSS.png", "./assets/images/logosDev/logoJS.png ", "./assets/images/logosDev/logoSEO.png", "./assets/images/logosDev/logoWave.png", "./assets/images/logosDev/logoResponsive.png", "./assets/images/logosDev/logoGitHub.png " ],
          "imageModalAlt": "Logos Languages",
          "link": "https://ninacarducciphotograph-pec2brv2u-ilonatgs-projects.vercel.app/",
          "linkGithub": "https://github.com/IlonaTG/Projet_9_optimiser_le_referencement_du_site_de_nina_carducci_photographe.git"
      },
      

      {
          "id": 5,
          "title": "ArgentBank",
          "descriptions": {
              "fr": "Implémentez le front-end d'une application bancaire avec React",
              "en": "Implement the front-end of a banking application with React"
          },
          "mission": {
            "fr": "La mission de ce projet était de développer le front-end d'une application bancaire en utilisant React et Redux pour créer une expérience utilisateur dynamique. Cela impliquait d'intégrer le front-end avec le back-end via des appels API, d'écrire des appels à l'API REST pour assurer une communication fluide, et de développer une interface utilisateur réactive et complète avec React. L'utilisation de Redux permet de gérer les données de l'application de manière cohérente. L'objectif était également de définir les points d'accès de l'API et de modéliser les interactions avec les données des transactions en utilisant Swagger, tout en acquérant de l'expérience pratique avec Node.js pour la gestion full-stack d'une application.",
            "en": "The mission of this project was to develop the front-end of a banking application using React and Redux to create a dynamic user experience. This involved integrating the front-end with the back-end through API calls, writing REST API calls to ensure smooth communication, and developing a reactive and comprehensive user interface with React. The use of Redux enabled consistent data management across the application. The objective was also to define API access points and model interactions with transaction data using Swagger, while gaining practical experience with Node.js for full-stack application management."
          },
          "image": "./assets/images/argentbank.webp",
          "imageModal": ["./assets/images/logosDev/logoHTML.png", "./assets/images/logosDev/logoCSS.png", "./assets/images/logosDev/logoJS.png ", "./assets/images/logosDev/logoReact.png ", "./assets/images/logosDev/logoRedux.png", "./assets/images/logosDev/logoAPI.png", "./assets/images/logosDev/logoSwagger.png", "./assets/images/logosDev/logoSASS.png", "./assets/images/logosDev/logoResponsive.png", "./assets/images/logosDev/logoGitHub.png" ],
          "imageModalAlt": "Logos Languages",
          "link": "lien_vers_le_projet_ArgentBank",
          "linkGithub": "https://github.com/IlonaTG/Projet11-ArgentBank-website.git",
          "categories": ["html-css", "react", "redux"]
      }
  ]
}
